trade_exp/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыЦен</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1fb40f0a-e884-485a-bccf-022c3665f19c">
    <name>Наценка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7358020a-89bd-417e-b5e3-86764d1e1073">
    <name>ИспользоватьПриПродаже</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60ce6002-9125-434e-a885-c105912cd6de">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7a3bb1cf-8b3e-4d0f-bcfd-3290721af2c9">
    <name>ВалютаЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a345a47-d3e9-45aa-9411-631bf37ab5b5">
    <name>Округлять</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="158e3051-f8b8-4aad-b9b2-048ec389faa8">
    <name>ТочностьОкругления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1d2bf011-0872-4b0a-836f-1f1cac36ad9f">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8bb83bf4-16ca-4973-a859-f25ddf6e92a5">
    <name>УстанавливатьЦенуПриВводеНаОсновании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d3558289-b2dd-419d-9358-1464c46b7059">
    <name>ИспользоватьПриПередачеМеждуОрганизациями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d4fe35a-8b45-46af-82e5-1c5f850812e2">
    <name>ВариантОкругления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28d3ae1a-9e39-42fb-a37a-7aa5cc06fe43">
    <name>ИспользоватьПриПередачеПродукцииДавальцу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a4eced6-5495-4ea4-8c02-95b4da425f6d">
    <name>ИспользоватьПриВыпускеПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81c638d4-cec1-4d8d-b40d-2b8068b8f117">
    <name>СпособЗаданияЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="635aaa83-cfd5-4bf6-9821-f02dbebd5658">
    <name>СхемаКомпоновкиДанных</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="83d8cc7a-c783-4f25-9ffd-ffd816a1c577">
    <name>Формула</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d5d0df8e-a617-45fa-9b79-2897a015fcef">
    <name>БазовыйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="43628aaf-86b2-4cd0-b124-2fdaa48dca2e">
    <name>ОграничениеВыбораВидаЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5832f477-e2da-48c5-9e69-3ba9d4138cbd">
    <name>Колонка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0f0e7a25-20a5-4d0b-8cfe-9ea940884cd2">
    <name>РегионПрисутствия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2393e3f3-c15b-429c-ad1e-90ff7bd48827">
    <name>ФорматПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d91c7937-9285-41b2-87c6-d244bab3fcbe">
    <name>ГруппаВидовЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3924f70a-b1a5-40aa-bea6-86014c135e08">
    <name>ОкруглятьВБольшуюСторону</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0905f10d-dfe0-4c1e-88a9-4b36f0dcab13">
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7cc80abb-50c8-4891-9105-ac07697c7fcc">
    <name>ВспомогательнаяЦена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a5ad99a6-da8d-4f8f-b439-17dfdcc12841">
    <name>ИспользоватьПриРозничнойПродаже</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2269303-43af-4ecc-a307-9692a9ba0177">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ab5b6c7-5186-4550-afa9-fee0accf6844">
    <name>ПорогСрабатыванияПриУменьшении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fd0fc873-c990-4b27-aba8-0b431c137a69">
    <name>ИспользоватьПриОптовойПродаже</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9385de79-e37d-4b5e-81c9-62eb69ed4706">
    <name>ЗапретитьРедактированиеЦеныЗаПределамиОтбора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7746f6a0-cfd8-40c9-88ee-ca52d89596b4">
    <name>ПорогСрабатывания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d3b60e9f-6cb5-4edf-80f6-08f584dd3e8a">
    <name>НеИспользуетсяВОбработкеЦО</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f8e8402a-a666-41e3-9508-d31324350c68">
    <name>ЦеновыеГруппы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9e53356d-097b-4984-bd61-cbe2e07ba3cc">
      <name>Формула</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="30312049-e1ad-4055-af85-ca6b39a64eac">
      <name>Наценка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="51846d68-4a56-45ff-bd36-16e22b9a7465">
      <name>ЦеноваяГруппа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a43ac27-5399-4d4d-82bf-f0b1ac0c671a">
      <name>БазовыйВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7301b27e-d7a4-4f78-9aad-723886f67448">
    <name>ПравилаОкругленияЦены</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6bacd5a4-effd-4f6a-850b-cb104db406c4">
      <name>НижняяГраницаДиапазонаЦен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0aa9cfd6-b145-4915-801d-ba2da61eae5b">
      <name>ПсихологическоеОкругление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1e1d055-8b0d-4410-bcdf-ea764f8c24aa">
      <name>ТочностьОкругления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="9ac7be66-4e68-4dda-afaa-0abfb8c7e289">
    <name>ПорогиСрабатывания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="79ca3b14-8df7-4cb4-a5b8-f8704930eb4f">
      <name>ПорогСрабатывания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ce7441c6-21ac-4723-9b7c-491953d9bd30">
      <name>ЦеноваяГруппа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="71bd315a-0e46-4383-a73f-a5980372d98b">
    <name>УточнениеПоНоменклатуре</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b10926ac-2c52-457b-a20d-0451c0ba777f">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f626cc9c-cb6c-4ac1-ac19-4b051841a0a6">
      <name>Наценка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="16c9431b-1774-4c66-9e9f-7203b9bf6435">
      <name>БазовыйВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f507aaac-3a0c-4392-9821-156205ca2cb2">
      <name>Формула</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="62eabc84-2f02-4676-97d3-bfd4d8d2aec8">
    <name>УточнениеПоЦеновымГруппамМД</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="03908f61-7b97-4ab6-887b-635cb5c16c33">
      <name>ЦеноваяГруппа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ce8a0e29-ba7b-4a5b-b2d6-edd0f9c4ce4b">
      <name>ВидЦен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="98a7e72e-d0ef-4b18-8f2d-7b3bb51e6947">
      <name>Порог1</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8e1987f3-a278-4694-8ddc-2449e646eb3a">
      <name>Порог2</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cbee525e-e48a-4444-936b-0820b2aa5326">
      <name>Порог3</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b96b236f-6db8-4e5c-9a64-5005b9041f3e">
      <name>Порог4</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b571e957-a1ff-41ef-9fb4-8a9e2ab1ee90">
      <name>ПроцентНаценки1</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4c771af1-1341-4c7e-87ef-b99340350726">
      <name>ПроцентНаценки2</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c9eae5b7-d6ca-4cd8-8a84-83a0a21f6c1c">
      <name>ПроцентНаценки3</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aa7c3510-cc30-47ac-9a51-d30b220ce441">
      <name>ПроцентНаценки4</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/ВидыЦен/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ОграничениеВыбораВидаЦены.ТолькоПросмотр = не (рольДоступна("ПолныеПрава") или рольДоступна("НазначениеСтатусовКлиентовВБонуснойПрограмме"));
	//Элементы.ГруппаВидовЦен.Видимость=ДопМодуль.НовоеЦенообразование();
	//Элементы.ФорматПодразделения.Видимость=ДопМодуль.НовоеЦенообразование();
	//Элементы.РегионПрисутствия.Видимость=ДопМодуль.НовоеЦенообразование();  
	//Элементы.СтраницаУточнениеПоЦеновымГруппам_МД.Видимость=ДопМодуль.НовоеЦенообразование();
КонецПроцедуры

#Область ЗагрузкаИзФайла
&НаКлиенте
Процедура ЗагрузитьИзФайла_Альтерра(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура();
	ПараметрыФормы.Вставить("НастройкиТаблицы",СтруктураТаблицы());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция СтруктураТаблицы()
	
	СтруктураТаблицы=Новый Структура();
	
	СтруктураТаблицы.Вставить("Код","строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура","СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Наценка","число#Наценка, %#10");

	возврат  СтруктураТаблицы;
КонецФункции 

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры)
	
	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		
		Если ТаблицаДанных<>Неопределено Тогда
			Объект.УточнениеПоНоменклатуре.Загрузить(ТаблицаДанных);
		КонецЕсли;
		для каждого стр из Объект.УточнениеПоНоменклатуре цикл
			стр.БазовыйВидЦены= Объект.БазовыйВидЦены;
		конеццикла;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&После ("НастроитьВидимостьЭлементовФормы")
&НаКлиентеНаСервереБезКонтекста
Процедура Док_НастроитьВидимостьЭлементовФормы(Форма)
	Форма.Элементы.СтраницаУточнениеПоНоменклатуре.Видимость=Форма.Элементы.СтраницаУточнениеПоЦеновымГруппам.Видимость;
	//Форма.Элементы.УточнениеПоНоменклатуреБазовыйВидЦены.Видимость=Форма.Элементы.ФормулыБазовыйВидЦены.Видимость;
	//Форма.Элементы.УточнениеПоНоменклатуреФормула.Видимость=Форма.Элементы.ФормулыФормула.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура Док_ГруппаВидовЦенПриИзмененииПосле(Элемент)
	 СоставитьНаименование(); 
КонецПроцедуры

&НаКлиенте
Процедура СоставитьНаименование()

	если значениезаполнено(Объект.ГруппаВидовЦен) и значениезаполнено(Объект.РегионПрисутствия)
		и значениезаполнено(Объект.ФорматПодразделения) тогда
		 Объект.Наименование=""+Объект.ГруппаВидовЦен+"_"+Объект.РегионПрисутствия+"_"+Объект.ФорматПодразделения;
	конецесли;	

КонецПроцедуры

&НаКлиенте
Процедура Док_РегионПрисутствияПриИзмененииПосле(Элемент)
	 СоставитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура Док_ФорматПодразделенияПриИзмененииПосле(Элемент)
 СоставитьНаименование();	
КонецПроцедуры
